{smcl}
{com}{sf}{ul off}{txt}
{com}. 
. use "titles_anonymized.dta", clear 
{txt}
{com}. list in 1/5, ab(20) 
{txt}
     {c TLC}{hline 10}{c -}{hline 8}{c -}{hline 14}{c -}{hline 7}{c TRC}
     {c |} {res}time_col   id_col   company_name   y_col {txt}{c |}
     {c LT}{hline 10}{c -}{hline 8}{c -}{hline 14}{c -}{hline 7}{c RT}
  1. {c |} {res}       3       17         oracle       8 {txt}{c |}
  2. {c |} {res}       2        1       deloitte       5 {txt}{c |}
  3. {c |} {res}       3        1       deloitte       6 {txt}{c |}
  4. {c |} {res}       1        1       deloitte       5 {txt}{c |}
  5. {c |} {res}       2      245         splunk       4 {txt}{c |}
     {c BLC}{hline 10}{c -}{hline 8}{c -}{hline 14}{c -}{hline 7}{c BRC}

{com}. 
. // main disco command
. disco y_col id_col time_col, idtarget(2) t0(3) agg("cdfDiff") seed(12143) /// 
>         mixture g(10) m(10) ci boots(300)
{res}{txt}
{com}.          
. // plot top 5 weights
. disco_weight id_col company_name, n(5)

{txt}Top 5 weights:
{hline 50}

  {c TLC}{hline 20}{c TT}{hline 8}{c TRC}
  {c |} {res}              name {txt}{c |} {res}weight {txt}{c |}
  {c LT}{hline 20}{c +}{hline 8}{c RT}
  {c |} {res}          linkedin {txt}{c |} {res} .4402 {txt}{c |}
  {c |} {res} dell technologies {txt}{c |} {res} .1212 {txt}{c |}
  {c |} {res}motorola solutions {txt}{c |} {res} .0856 {txt}{c |}
  {c |} {res}            nvidia {txt}{c |} {res} .0818 {txt}{c |}
  {c |} {res}            amazon {txt}{c |} {res} .0799 {txt}{c |}
  {c BLC}{hline 20}{c BT}{hline 8}{c BRC}

{com}. 
. // plot summary table
. disco_estat summary

{txt}Summary of CDF effects
{hline 80}
Time period   Range                    Effect     Std. Err.    [.95% Conf. Interval]
{hline 80}
        3         1.00-     3.25    {res}    0.006        0.006       -0.006      0.018{txt}
        3         3.25-     5.50    {res}    0.001        0.006       -0.011      0.013{txt}
        3         5.50-     7.75    {res}   -0.001        0.006       -0.013      0.011{txt}
        3         7.75-    10.00    {res}   -0.002        0.006       -0.014      0.011{txt}
{hline 80}
* denotes significance at .95% confidence level

{com}. 
. // plot CDF effects
. disco_plot, title(" ") ytitle("Change in CDF") hline(0) categorical /// 
>         scheme("stsj") color("bluishgray") 
{res}{txt}
{com}. graph export "${c -(}figs{c )-}/title_cdfDiff.pdf", replace
{txt}{p 0 4 2}
file {bf}
/Users/davidvandijcke/University of Michigan Dropbox/David Van Dijcke/Flo_GSRA/sj_replication/results/figs/title_cdfDiff.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. // plot synthetic vs. treated CDF
. disco_plot, title(" ") ytitle("Tenure (Days)") agg("cdf") scheme("stsj")
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/zs/20zk30ss1dq_90y7_2t9wgvc0000gn/T//SD87111.000000"
{txt}
{com}. 
. // main disco command
. disco y_col id_col time_col, idtarget(2) t0(3) agg("cdfDiff") seed(12143) /// 
>         mixture g(10) m(10) ci boots(300)
{res}{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

end of do-file

{err}{hline 2}Break{hline 2}
{txt}{search r(1), local:r(1);}

{com}. do "/var/folders/zs/20zk30ss1dq_90y7_2t9wgvc0000gn/T//SD87111.000000"
{txt}
{com}. 
. // plot CDF effects
. disco_plot, title(" ") ytitle("Change in CDF") hline(0) categorical /// 
>         scheme("stsj") color("bluishgray") 
{res}{txt}
{com}. graph export "${c -(}figs{c )-}/title_cdfDiff.pdf", replace
{txt}{p 0 4 2}
file {bf}
/Users/davidvandijcke/University of Michigan Dropbox/David Van Dijcke/Flo_GSRA/sj_replication/results/figs/title_cdfDiff.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/zs/20zk30ss1dq_90y7_2t9wgvc0000gn/T//SD87111.000000"
{txt}
{com}. 
.         // Title
.         clear all
{res}{txt}
{com}.         gzimport delimited using "${c -(}dataIn{c )-}/titles_stata.csv.gz", clear
Importing gzipped data in /Users/davidvandijcke/University of Michigan Dropbox/David Van Dijcke/Flo_GSRA/sj_replication/data/in/titles_stata.csv.gz
{res}{text}(6 vars, 1,141,518 obs)

{com}. 
.         // Generate noise with position-specific probabilities
.         gen noise = 0
{txt}
{com}.         // Reduced noise (5% chance each way) for lowest and highest positions
.         replace noise = -1 if runiform() < 0.05 & (y_col == 1 | y_col == 10)
{txt}(403 real changes made)

{com}.         replace noise = 1 if runiform() < 0.05 & noise == 0 & (y_col == 1 | y_col == 10)
{txt}(372 real changes made)

{com}. 
.         // Moderate noise (15% chance each way) for middle positions
.         replace noise = -1 if runiform() < 0.1 & y_col > 1 & y_col < 10 & noise == 0
{txt}(113,451 real changes made)

{com}.         replace noise = 1 if runiform() < 0.1 & y_col > 1 & y_col < 10 & noise == 0
{txt}(101,642 real changes made)

{com}. 
.         // Apply noise and enforce bounds
.         gen y_col_anonymized = y_col + noise
{txt}
{com}.         replace y_col_anonymized = 1 if y_col_anonymized < 1
{txt}(5 real changes made)

{com}.         replace y_col_anonymized = 10 if y_col_anonymized > 10
{txt}(364 real changes made)

{com}. 
. 
.         // Check the effect
.         tabulate y_col y_col_anonymized

           {txt}{c |}                               y_col_anonymized
     y_col {c |}         1          2          3          4          5          6          7 {c |}     Total
{hline 11}{c +}{hline 77}{c +}{hline 10}
         1 {c |}{res}       186          8          0          0          0          0          0 {txt}{c |}{res}       194 
{txt}         2 {c |}{res}     2,343     18,794      2,107          0          0          0          0 {txt}{c |}{res}    23,244 
{txt}         3 {c |}{res}         0        159      1,211        151          0          0          0 {txt}{c |}{res}     1,521 
{txt}         4 {c |}{res}         0          0     40,777    329,299     36,339          0          0 {txt}{c |}{res}   406,415 
{txt}         5 {c |}{res}         0          0          0     51,319    416,251     46,302          0 {txt}{c |}{res}   513,872 
{txt}         6 {c |}{res}         0          0          0          0        481      4,058        428 {txt}{c |}{res}     4,967 
{txt}         7 {c |}{res}         0          0          0          0          0      1,177      9,873 {txt}{c |}{res}    12,148 
{txt}         8 {c |}{res}         0          0          0          0          0          0     14,280 {txt}{c |}{res}   142,235 
{txt}         9 {c |}{res}         0          0          0          0          0          0          0 {txt}{c |}{res}    28,960 
{txt}        10 {c |}{res}         0          0          0          0          0          0          0 {txt}{c |}{res}     7,962 
{txt}{hline 11}{c +}{hline 77}{c +}{hline 10}
     Total {c |}{res}     2,529     18,961     44,095    380,769    453,071     51,537     24,581 {txt}{c |}{res} 1,141,518 


           {txt}{c |}         y_col_anonymized
     y_col {c |}         8          9         10 {c |}     Total
{hline 11}{c +}{hline 33}{c +}{hline 10}
         1 {c |}{res}         0          0          0 {txt}{c |}{res}       194 
{txt}         2 {c |}{res}         0          0          0 {txt}{c |}{res}    23,244 
{txt}         3 {c |}{res}         0          0          0 {txt}{c |}{res}     1,521 
{txt}         4 {c |}{res}         0          0          0 {txt}{c |}{res}   406,415 
{txt}         5 {c |}{res}         0          0          0 {txt}{c |}{res}   513,872 
{txt}         6 {c |}{res}         0          0          0 {txt}{c |}{res}     4,967 
{txt}         7 {c |}{res}     1,098          0          0 {txt}{c |}{res}    12,148 
{txt}         8 {c |}{res}   115,322     12,633          0 {txt}{c |}{res}   142,235 
{txt}         9 {c |}{res}     2,915     23,461      2,584 {txt}{c |}{res}    28,960 
{txt}        10 {c |}{res}         0        398      7,564 {txt}{c |}{res}     7,962 
{txt}{hline 11}{c +}{hline 33}{c +}{hline 10}
     Total {c |}{res}   119,335     36,492     10,148 {txt}{c |}{res} 1,141,518 
{txt}
{com}. 
.         // Update and keep relevant columns
.         replace y_col = y_col_anonymized
{txt}(215,499 real changes made)

{com}.         keep id_col company_name y_col time_col
{txt}
{com}. 
. 
.         // Save the anonymized dataset as a Stata file
.         save "${c -(}dataOut{c )-}/titles_anonymized.dta", replace
{txt}{p 0 4 2}
file {bf}
/Users/davidvandijcke/University of Michigan Dropbox/David Van Dijcke/Flo_GSRA/sj_replication/data/out/titles_anonymized.dta{rm}
saved
{p_end}

{com}. 
{txt}end of do-file

{com}. do "/var/folders/zs/20zk30ss1dq_90y7_2t9wgvc0000gn/T//SD87111.000000"
{txt}
{com}. 
. use "titles_anonymized.dta", clear 
{txt}
{com}. list in 1/5, ab(20) 
{txt}
     {c TLC}{hline 10}{c -}{hline 8}{c -}{hline 14}{c -}{hline 7}{c TRC}
     {c |} {res}time_col   id_col   company_name   y_col {txt}{c |}
     {c LT}{hline 10}{c -}{hline 8}{c -}{hline 14}{c -}{hline 7}{c RT}
  1. {c |} {res}       3       17         oracle       8 {txt}{c |}
  2. {c |} {res}       2        1       deloitte       5 {txt}{c |}
  3. {c |} {res}       3        1       deloitte       5 {txt}{c |}
  4. {c |} {res}       1        1       deloitte       5 {txt}{c |}
  5. {c |} {res}       2      245         splunk       4 {txt}{c |}
     {c BLC}{hline 10}{c -}{hline 8}{c -}{hline 14}{c -}{hline 7}{c BRC}

{com}. 
. // main disco command
. disco y_col id_col time_col, idtarget(2) t0(3) agg("cdfDiff") seed(12143) /// 
>         mixture g(10) m(10) ci boots(300)
{res}{p 0 9 2}{error:Warning: Problem is infeasible.}{p_end}
{p 0 9 2}{error:Warning: Problem is infeasible.}{p_end}
{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/zs/20zk30ss1dq_90y7_2t9wgvc0000gn/T//SD87111.000000"
{txt}
{com}. 
. // plot CDF effects
. disco_plot, title(" ") ytitle("Change in CDF") hline(0) categorical /// 
>         scheme("stsj") color("bluishgray") 
{res}{txt}
{com}. 
{txt}end of do-file

{com}. do "/var/folders/zs/20zk30ss1dq_90y7_2t9wgvc0000gn/T//SD87111.000000"
{txt}
{com}.          
. // plot top 5 weights
. disco_weight id_col company_name, n(5)

{txt}Top 5 weights:
{hline 50}

  {c TLC}{hline 19}{c TT}{hline 8}{c TRC}
  {c |} {res}             name {txt}{c |} {res}weight {txt}{c |}
  {c LT}{hline 19}{c +}{hline 8}{c RT}
  {c |} {res}        protiviti {txt}{c |} {res} .3016 {txt}{c |}
  {c |} {res}           intuit {txt}{c |} {res}  .234 {txt}{c |}
  {c |} {res}dell technologies {txt}{c |} {res} .1436 {txt}{c |}
  {c |} {res}         linkedin {txt}{c |} {res} .1149 {txt}{c |}
  {c |} {res}           citrix {txt}{c |} {res} .0602 {txt}{c |}
  {c BLC}{hline 19}{c BT}{hline 8}{c BRC}

{com}. 
. // plot summary table
. disco_estat summary

{txt}Summary of CDF effects
{hline 80}
Time period   Range                    Effect     Std. Err.    [.95% Conf. Interval]
{hline 80}
        3         1.00-     3.25    {res}    0.009        0.006       -0.003      0.022{txt}
        3         3.25-     5.50    {res}    0.006        0.006       -0.007      0.018{txt}
        3         5.50-     7.75    {res}    0.005        0.006       -0.008      0.017{txt}
        3         7.75-    10.00    {res}   -0.000        0.006       -0.013      0.012{txt}
{hline 80}
* denotes significance at .95% confidence level

{com}. 
. // plot CDF effects
. disco_plot, title(" ") ytitle("Change in CDF") hline(0) categorical /// 
>         scheme("stsj") color("bluishgray") 
{res}{txt}
{com}. graph export "${c -(}figs{c )-}/title_cdfDiff.pdf", replace
{txt}{p 0 4 2}
file {bf}
/Users/davidvandijcke/University of Michigan Dropbox/David Van Dijcke/Flo_GSRA/sj_replication/results/figs/title_cdfDiff.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
. // plot synthetic vs. treated CDF
. disco_plot, title(" ") ytitle("Tenure (Days)") agg("cdf") scheme("stsj")
{res}{txt}
{com}. 
. graph export "${c -(}figs{c )-}/title_cdf.pdf", replace
{txt}{p 0 4 2}
file {bf}
/Users/davidvandijcke/University of Michigan Dropbox/David Van Dijcke/Flo_GSRA/sj_replication/results/figs/title_cdf.pdf{rm}
saved as
PDF
format
{p_end}

{com}. 
{txt}end of do-file

{com}. help disco_plot

. help disco_plot

. 